Documents/БюджетГод.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>БюджетГод</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БДР</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБюджета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НедельноеПланирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьГашение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Детализация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяДР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Comment>номер месяца</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РасходСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>РасходСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.БДР</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоПрогноз</Name>
					<Comment>означает, что этот документ - планируемый, т.е.вместо него будет введе другой документ, не обязательно с такими же параметрами</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммыВТабЧасти</Name>
					<Comment>истина-используется таб часть, ложь-реквизит шапки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДетализацияПоНоменклатуре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Comment>для недельного планирования</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.БюджетГод</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроводитьОвер</Name>
					<Comment>иногда надо провести не в кредит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоходыРасходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяДР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СодержаниеОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Кошельки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Кошельки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКошелька</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКошельков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКредита</Name>
					<Comment>если это кредит в банке</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКредитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКредитПолученный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетОстатковБюджет</Name>
					<Comment>по этим кошелькам будут рассчитываться остатки для бюджета</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБанковскогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыБанковскихСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКошелька</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКошельков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитнаяКарта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Comment>процентная ставка по кредиту/депозиту</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Comment>дни, месяцы или годы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаСрока</Name>
					<Comment>0-дни, 1-месяцы,2-годы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Капитализация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачОст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НедельноеПланирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКредитГашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧестныйОвердрафт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрейсПериодВДнях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГраницаПополненияВДнях</Name>
					<Comment>за N дней до конца пополнение прекращается</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/БюджетГод/Forms/ФормаВводПоНеделям/Ext/Form/Module.bsl
//реквизиты формы
//ТабПериодовНеделя
//колонки
//НомерМесяца - число, номер месяца в году
//НомерНедели - число, номер недели в месяца (т.е. от 1 до 6)
//Начало - дата, начало недели
//Конец - дата, конец недели

//заполняет таблицу строками, в которых указан номер месяца, 
//номер недели в месяце, даты: начало и конец недели
&НаКлиенте
Процедура ЗаполнитьТаблицуПериодовНеделя()
	ТекДата = НачалоГода(Дата);
	КонГода = КонецГода(ТекДата)+1;
	НомерНедели  = 1;
	НомерМес = 1;
	Начало = ТекДата;
	Пока ТекДата<КонГода Цикл
		
		Если ДеньНедели(ТекДата) = 7 ИЛИ КонецМесяца(ТекДата) = КонецДня(ТекДата) Тогда
			ДобавитьНеделю(НомерМес, НомерНедели, Начало, ТекДата);
			Если КонецМесяца(ТекДата) = КонецДня(ТекДата) Тогда
				//это воскресенье - последний день месяца
				НомерМес = НомерМес + 1;
				НомерНедели  = 1;
			Иначе
				НомерНедели = НомерНедели + 1;
			КонецЕсли;
				
			Начало = ТекДата + 86400;
		КонецЕсли;
				
		ТекДата = ТекДата + 86400;
	КонецЦикла;
	
КонецПроцедуры

//строку в таблицу "ТабПериодовНеделя"
&НаКлиенте
Процедура ДобавитьНеделю(НомерМес, НомерНедели, Начало, Конец)
	НовСтр = ТабПериодовНеделя.Добавить();
	НовСтр.НомерМесяца = НомерМес;
	НовСтр.НомерНедели = НомерНедели;
	НовСтр.Начало = Начало;
	НовСтр.Конец = Конец;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТаблицуПериодовНеделя();
	//скрыть лишние столбцы
	ПоискСтрок = ТабПериодовНеделя.НайтиСтроки(Новый Структура("НомерМесяца",НомерМесяца));
	Для сч = 1 по 6 Цикл
		Элементы["ТабДанныхНеделя"+сч].Видимость=Ложь;
	КонецЦикла;
	Для Каждого Эл Из ПоискСтрок Цикл
		Элементы["ТабДанныхНеделя"+Эл.НомерНедели].Видимость=Истина;
		Элементы["ТабДанныхНеделя"+Эл.НомерНедели].Заголовок=Формат(Эл.НАчало,"ДФ=дд")+" - "+Формат(Эл.Конец, "ДФ=дд");
	КонецЦикла;
	ТабДанных.Очистить();
	ЗаполнитьКошелькиСервер();
	ЗаполнитьДанныеПрогноз();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКошелькиСервер()
	ТЗ = ДанныеФормыВЗначение(ТабДанных, тип("ТаблицаЗначений"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Кошельки.Ссылка,
		|	Кошельки.Валюта
		|ИЗ
		|	Справочник.Кошельки КАК Кошельки
		|ГДЕ
		|	Кошельки.НедельноеПланирование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Кошельки.Наименование";

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовСтр = ТЗ.Добавить();
		НовСтр.Кошелек = Выборка.Ссылка;
		НовСтр.Валюта = Выборка.Валюта;

	КонецЦикла;


	ЗначениеВДанныеФормы(ТЗ, ТабДанных);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьДанныеПрогноз()
	
	ЗаполнитьДанныеПрогнозСервер();	
	ПересчитатьИтог();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПрогнозСервер()
	ТЗ = ДанныеФормыВЗначение(ТабДанных, тип("ТаблицаЗначений"));
	
	ПоискСтрок = ТабПериодовНеделя.НайтиСтроки(Новый Структура("НомерМесяца",НомерМесяца));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Сумма КАК Сумма,
		|	Док.Дата КАК Дата,
		|	Док.Кошелек,
		|	Док.Ссылка
		|ИЗ
		|	Документ.РасходСредств КАК Док
		|ГДЕ
		|	Док.СтатьяДР = &СтатьяДР
		|	И Док.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И Док.ЭтоПрогноз
		|	И Док.Бюджет = &Бюджет";

	Запрос.УстановитьПараметр("ДатаНач", ПоискСтрок[0].Начало);
	Запрос.УстановитьПараметр("ДатаКон", ПоискСтрок[ПоискСтрок.Количество()-1].Конец);
	Запрос.УстановитьПараметр("СтатьяДР", СтатьяДР);
	Запрос.УстановитьПараметр("Бюджет", Бюджет);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		Для Каждого Эл из ПоискСтрок Цикл
			//документы прогноза только в начале недели или в первом дне месяца
			//Если Выборка.Дата>=ЭЛ.Начало И Выборка.Дата<Эл.Конец Тогда
			Если Выборка.Дата=ЭЛ.Начало Тогда
				//сначала поиск строки с кошельком
				ПС = ТЗ.Найти(Выборка.Кошелек, "Кошелек");
				Если НЕ ПС=Неопределено Тогда
					ПС["Неделя"+ЭЛ.НомерНедели] = Выборка.Сумма;
					ПС["Док"+ЭЛ.НомерНедели] = Выборка.Ссылка;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ЗначениеВДанныеФормы(ТЗ, ТабДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДанныхПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПересчитатьИтог();
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьИтог()
	Итого=0;
	Для Каждого Стр Из ТАбДанных Цикл
		Стр.Итого=0;
		Для сч = 1 по 6 цикл
			Итого = Итого+Стр["Неделя"+сч];
			Стр.Итого= Стр.Итого+Стр["Неделя"+сч];
		КонецЦИкла;
	КонецЦИкла;

КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	//записать и закрыть
	СоздатьДДС();
	Закрыть(Итого);	
КонецПроцедуры

&НаСервере
Процедура СоздатьДДС()
	
	//получаем таблицу с формы
	ТЗ = ДанныеФормыВЗначение(ТабДанных, тип("ТаблицаЗначений"));
	
	//ищем строки с нужным месяцем в большой таблице периодов (за весь год)
	ПоискСтрок = ТабПериодовНеделя.НайтиСтроки(Новый Структура("НомерМесяца",НомерМесяца));
	
	Для Каждого Стр Из ТЗ Цикл
		//если нет плана на какую-то неделю - пропускаем строку
		Если Стр.Итого=0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для сч = 1 по 6 цикл
			//есил сумма 0 и документа нет, ничего не делаем
			Если Стр["Неделя"+сч]=0 И НЕ ЗначениеЗаполнено(Стр["Док"+сч]) Тогда   
				Продолжить;
			//если что-то (ссылка над документ) есть в служебной колонке "ДокХХ" -
			//обновляем этот документ
			ИначеЕсли ЗначениеЗаполнено(Стр["Док"+сч]) Тогда
				ДокОбъект 			= Стр["Док"+сч].ПолучитьОбъект();
				ДокОбъект.Сумма 	= Стр["Неделя"+сч] ;
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);

			//если служебная колонка "ДокХХ" пустая, но есть план - создать документ
			ИначеЕсли НЕ Стр["Неделя"+сч] =0 И НЕ ЗначениеЗаполнено(Стр["Док"+сч]) Тогда
				//документа нет - надо создать
				
				ДокОбъект 				= Документы.РасходСредств.СоздатьДокумент();
				ДокОбъект.Бюджет		= Бюджет;
				ДокОбъект.Дата 			= ПоискСтрок[сч-1].Начало;
				ДокОбъект.Сумма 		= Стр["Неделя"+сч] ;
				ДокОбъект.Кошелек 		= Стр.Кошелек;
				ДокОбъект.ПриИзмененииКошелька(); 
				ДокОбъект.СтатьяДР 		= СтатьяДР;
				ДокОбъект.ЭтоПрогноз 	= Истина;
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);

			КонецЕсли;
			
		КонецЦИкла;
	КонецЦИкла;
	
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
	//просто закрыть
	Закрыть(Неопределено);
КонецПроцедуры
